{
  "Introduction": [
    {
      "n": 1,
      "Character": "Player",
      "Text": "Hi, mom, hi, dad."
    },
    {
      "n": 2,
      "Character": "Parents",
      "Text": "… (No response)"
    },
    {
      "n": 3,
      "Character": "Player",
      "Text": "Tomorrow is the restaurant’s grand reopening. I have butterflies in my stomach, I hope everything goes well. I have taken up this business for you, it was your dream for me to inherit it after all."
    },
    {
      "n": 4,
      "Character": "Parents",
      "Text": "… (No response)"
    },
    {
      "n": 5,
      "Character": "Player",
      "Text": "I know there’s still a lot of work left to do, I’m also aware that it looks nothing like it did before, but I’ll make sure to work hard until it does."
    },
    {
      "n": 6,
      "Character": "Parents",
      "Text": "… (No response)"
    },
    {
      "n": 7,
      "Character": "Player",
      "Text": "All I want is to make you guys happy, I want to make you two proud."
    }
  ],
  "Day 1 introduction": [
    {
      "n": 1,
      "Character": "Player",
      "Text": "Today is the day of the inauguration, I hope everything goes well. I’ll make sure to notify my pops’ old friends. They were all really excited about this, so they’ll surely come to say hi."
    }
  ],
  "Day 1 ending": [
    {
      "n": 1,
      "Character": "Player",
      "Text": "Wow, this was way tougher than I thought It would be. This must have been tough for my parents… Poor them, the things they had to leave behind because of me…"
    }
  ],
  "Day 2 conversation": [
    {
      "n": 1,
      "Character": "none",
      "Text": "(The phone is ringing; the protagonist picks it up)"
    },
    {
      "n": 2,
      "Character": "Player",
      "Text": "Hello? Who is this?"
    },
    {
      "n": 3,
      "Character": "Rival",
      "Text": "Hi, -protagonist’s name-."
    },
    {
      "n": 4,
      "Character": "Player",
      "Text": "Who is this?! How do you know my name?"
    },
    {
      "n": 5,
      "Character": "Rival",
      "Text": "You can ask your parents, I’m sure they will remember me."
    },
    {
      "n": 6,
      "Character": "Player",
      "Text": "Why? Do you want anything from them?"
    },
    {
      "n": 7,
      "Character": "Rival",
      "Text": "Have they not talked to you about me? Did they think I would have forgotten about your dear restaurant after all these years?"
    },
    {
      "n": 8,
      "Character": "Player",
      "Text": "I know you; I know the type of guy you are. My parents have told me everything about you."
    },
    {
      "n": 9,
      "Character": "Rival",
      "Text": "You know what I want then, I’m also sure you know I’ll do anything to get my hands on it, should you not give it to me willingly."
    },
    {
      "n": 10,
      "Character": "Player",
      "Text": "You have really underestimated me if you think you’ll break me the same way you broke my parents. I will never yield to the likes of you! I will never close this place down!"
    },
    {
      "n": 11,
      "Character": "Rival",
      "Text": "That is exactly what your parents said at first, look at how that worked out for them."
    },
    {
      "n": 12,
      "Character": "Player",
      "Text": "Come for me then! You do not scare me! Come a…-!"
    },
    {
      "n": 13,
      "Character": "none",
      "Text": "(RIVAL RESTAURANT’S OWNER hangs up the phone)"
    },
    {
      "n": 14,
      "Character": "Player",
      "Text": "Who does he think he is!? How dare he try to mess with ME! Whatever, I need to calm down. Mom, Dad, I hope I don’t do anything I’ll regret later…"
    }
  ],
  "First encounter with thieves": [
    {
      "n": 1,
      "Character": "Player",
      "Text": "What was that noise?! What’s going on in the pantry?"
    },
    {
      "n": 2,
      "Character": "Player",
      "Text": "What are you doing here!? Get out!"
    },
    {
      "n": 3,
      "Character": "Player",
      "Text": "You too! Go away!"
    },
    {
      "n": 4,
      "Character": "Player",
      "Text": "Mom, Dad, I don’t think I’ll be able to control myself. I need to breathe."
    },
    {
      "n": 5,
      "Character": "Player",
      "Text": "What are you doing here!? I thought I told you to never come back! (THE PROTAGONIST slams the intruder into the ground and starts hitting him until he goes away) Mom, Dad! I’m not sure I’ll be able to tolerate this any longer."
    },
    {
      "n": 6,
      "Character": "Player",
      "Text": "YOU ARE NOW GOING TO LEARN THE CONSEQUENCES TO YOUR ACTIONS, YOU SHOULD HAVE NEVER COME HERE"
    },
    {
      "n": 7,
      "Character": "Player",
      "Text": "Huff, huff… What have I done!? I killed him… What am I going to do now?  The freezer. Yeah. I’ll hide him there. Wait, maybe I could… No, no. That would be madness. I don’t know what to do… The restaurant comes first… The intruders will be the main dish."
    }
  ],
  "Day 2 kill ending": [
    {
      "n": 1,
      "Character": "Player",
      "Text": "What have I done!? What are mom and dad going to think of me? I’m sure they’ll be angry at me, but it’s not like I can lie to them, that would disappoint them. I’m sure they’ll understand I’m doing this for them."
    },
    {
      "n": 2,
      "Character": "Rival",
      "Text": "One of my employees hasn’t come back. I don’t know what you’ve done with him, but I’ll be sure to make you pay if you’ve hurt him. Watch your step, you will not be safe in that “restaurant” of yours."
    }
  ],
  "Day 2 scare ending": [
    {
      "n": 1,
      "Character": "Player",
      "Text": "Ooof… I didn’t think he would be serious about his threats. It doesn’t matter though, let them come, I’ll kick them all out. I’ll do this for mom and dad, the restaurant will be open, I’ll make sure of it."
    }
  ],
  "Day 3 kill dialogue": [
    {
      "n": 1,
      "Character": "Player",
      "Text": "Mom, dad, I wasn’t able to hold back. I promised you I wouldn’t hurt a living being ever again, but I broke my promise."
    },
    {
      "n": 2,
      "Character": "Parents",
      "Text": "…"
    },
    {
      "n": 3,
      "Character": "Player",
      "Text": "It was for a good reason. You two loved the restaurant, it was so important to you, I need to protect it."
    },
    {
      "n": 4,
      "Character": "Parents",
      "Text": "…"
    },
    {
      "n": 5,
      "Character": "Player",
      "Text": "Family always goes first, it’s what you taught me… I had to cross the line, it was for a good reason, I can’t let the restaurant close."
    },
    {
      "n": 6,
      "Character": "Parents",
      "Text": "…"
    },
    {
      "n": 7,
      "Character": "Player",
      "Text": "I Will do as I promised, I won’t let anyone laugh at this place… Not while I’m alive."
    }
  ],
  "Day 3 scare dialogue": [
    {
      "n": 1,
      "Character": "Player",
      "Text": "Mom, dad, today was a tough day. Our rivals have threatened me. I wanted to hurt them so badly, but I held back for you. I promised I would never hurt anyone or anything again."
    },
    {
      "n": 2,
      "Character": "Parents",
      "Text": "…"
    },
    {
      "n": 3,
      "Character": "Player",
      "Text": "I know this was the right choice. I hope I can continue to keep my word, no promises though…"
    },
    {
      "n": 4,
      "Character": "Parents",
      "Text": "…"
    },
    {
      "n": 5,
      "Character": "Player",
      "Text": "The business is going well. If I can keep this up, I’ll soon be able to renovate the place."
    },
    {
      "n": 6,
      "Character": "Parents",
      "Text": "…"
    },
    {
      "n": 7,
      "Character": "Player",
      "Text": "Don’t worry, I won’t completely change it, I’ll just upgrade it. I’ll make sure it keeps its identity, this place is yours after all."
    }
  ],
  "Day 4 kill dialogue": [
    {
      "n": 1,
      "Character": "Player",
      "Text": "Mom, dad, I wanted to talk to you about all the murders. I know what I’m doing is wrong, but at least their body will have a purpose even after their death."
    },
    {
      "n": 2,
      "Character": "Parents",
      "Text": "…"
    },
    {
      "n": 3,
      "Character": "Player",
      "Text": "I know, I know, killing people is bad. Do you really think I feel no remorse?"
    },
    {
      "n": 4,
      "Character": "Parents",
      "Text": "…"
    },
    {
      "n": 5,
      "Character": "Player",
      "Text": "Don’t complain so much, it was thanks to them that I learned how to cook."
    },
    {
      "n": 6,
      "Character": "Parents",
      "Text": "…"
    },
    {
      "n": 7,
      "Character": "Player",
      "Text": "Look, I know you won’t understand me, but I’m sure you’ll be grateful down the line. You teached me family first, so I will do anything to keep this family going."
    }
  ]
}